{
    "title": "Koji Fried Chicken",
    "yield": "8 pieces",
    "description": "Lets use the tenderizing and flavor-boosting properies of shio koji to marinate a bunch of chicken, then deepfry it to perfection.",
    "ingredients": [{
            "ingredient": "Bone-in chicken pieces (split breasts cut in half, drumsticks, and thighs), trimed",
            "quantity": "1,500",
            "unit": "g"
        },
        {
            "ingredient": "Shio koji",
            "quantity": "150",
            "unit": "g"
        },
        {
            "ingredient": "Firm granular rice koji",
            "quantity": "110",
            "unit": "g",
            "url": "http://www.pacificeastwest.com/072546382100.html"
        },
        {
            "ingredient": "Pastry flour, or all-purpose",
            "quantity": "265",
            "unit": "g"
        },
        {
            "ingredient": "Paprika",
            "quantity": "13",
            "unit": "g"
        },
        {
            "ingredient": "Onion Powder",
            "quantity": "10",
            "unit": "g"
        },
        {
            "ingredient": "Garlic Powder",
            "quantity": "2.5",
            "unit": "g"
        },
        {
            "ingredient": "Buttermilk",
            "quantity": "250",
            "unit": "g"
        },
        {
            "ingredient": "Frying oil",
            "quantity": "1",
            "unit": "L"
        }
    ],
    "directions": [
        {
            "title": "Marinate",
            "steps": [
                "Combine chicken and shio koji in 1-gallon zipper lock bag.",
                "Massage bag to evenly distribute shio koji, press out excess air and seal.",
                "Refrigerate for 3 days."
            ]
        },
        {
            "title": "Cook",
            "steps": [
                "After marinating for three days, set up your water bath and set the temperature to 155 °F",
                "Combine all the dark meat (legs and thighs) into one bag and the breast meat into another bag.",
                "(Be careful to not overlap any of the pieces, you want them to have some breathing room in the bag so that they all cook evenly.)"
            ]
        },
        {
            "title": "Make breading",
            "steps": [
                "Combine dry koji and flour in a blender and blend on high until finely ground about 2 minutes.",
                "Add to a large shallow bowl with paprika, onion powder, garlic powder, and any other dry spices you like.",
                "Pour the buttermilk into a bowl and get ready to bread your chicken."
            ]
        },
        {
            "title": "Bread em'",
            "image": {
                "url": "/img/koji-fried-chicken/breaded.jpg",
                "title": "Breaded chicken after refrigeration",
                "alt": "Breaded chicken after refrigeration"
            },
            "steps": [
                "When the chicken is done, remove it from the water bath and let it cool for a bit so it's easier to handle.",
                "I like a good crunch on my fried chicken, so I dredge the pieces in the flour mixture, then the buttermilk, then the flour again, and place them on a wire rack set on a rimmed baking sheet.",
                "Let the breaded chicken sit in the fridge uncovered for 24 hours to let the breading get nice and dry."
            ]
        },
        {
            "title": "Fry em' up",
            "image": {
                "url": "/img/koji-fried-chicken/cooked.jpg",
                "title": "Finished chicken",
                "alt": "Finished chicken"
            },
            "steps": [
                "Adjust oven rack to middle position and heat to 200 °F.",
                "Add oil to dutch oven or heavy bottomed stock pot and heat to 400 °F.",
                "Working in batches of 2 or 3 pieces at a time, fry the chicken just long enough to the crust golden brown 2 - 3 minutes.",
                "Remove from the fryer and place on wire rack in a rimmed baking sheet in the oven",
                "Season with salt, and serve!"
            ]
        }
    ]
}
